# Functions

In [1]:
import pandas as pd
import seaborn as sb

In [8]:
print(sb.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [2]:
df = sb.load_dataset("tips")
titanic=sb.load_dataset("titanic")
products=pd.read_csv("data/products.csv")

In [3]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
pup = pd.read_csv('data/Pupils.csv')

In [6]:
pup.head()

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0  adar    6      SP     113      30   70   16700      7       6     1   M
1  agam    6      GR     172      71   92    9200      5       4     2   F
2   avi    7     ISR     143      58   82   12000      3       7     1   M
3  dani    7      US     160      70   90   15000      4       4     2   M
4  dina    7     ISR     110      26   64   10000      6       8     1   F

In [9]:
pup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 11 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     30 non-null     object
 1   Age      30 non-null     int64
 2   Country  30 non-null     object
 3   Height   30 non-null     int64
 4   Weight   30 non-null     int64
 5   avg      30 non-null     int64
 6   income   30 non-null     int64
 7   rooms    30 non-null     int64
 8   family   30 non-null     int64
 9   type     30 non-null     int64
 10  gen      30 non-null     object
dtypes: int64(8), object(3)
memory usage: 2.7+ KB

# String Functions

In [12]:
pup["Name"]

0        adar
1        agam
2         avi
3        dani
4        dina
5       efrat
6        ehud
7         eli
8       ester
9     evyatar
10     itamar
11       liel
12     lilach
13        mia
14     michal
15      moshe
16       noya
17       ofer
18       ohad
19       omer
20       orit
21       orit
22       rina
23      shely
24      talya
25      tomer
26        udi
27      yafit
28       yoav
29       yosi
Name: Name, dtype: object

In [11]:
#Get the first row
pup["Name"][0]

'adar'

In [14]:
#pup[["Name","Age"]][0]--Return error

KeyError: 0

In [15]:
pup["Name"].str[0].head()

0    a
1    a
2    a
3    d
4    d
Name: Name, dtype: object

In [16]:
pup["Name"].str[0:3].head()

0    ada
1    aga
2    avi
3    dan
4    din
Name: Name, dtype: object

In [ ]:
#slice() - Slice substrings from each element in the Series or Index.

In [17]:
pup["Name"].str.slice(0,3).head()

0    ada
1    aga
2    avi
3    dan
4    din
Name: Name, dtype: object

In [18]:
pup["Name"].str.slice(1,3).head()

0    da
1    ga
2    vi
3    an
4    in
Name: Name, dtype: object

In [19]:
pup["Name"].str.slice(0,6,2).head()

0    aa
1    aa
2    ai
3    dn
4    dn
Name: Name, dtype: object

In [20]:
pup["Name"].str.slice(4,0,-1).head()

0    rad
1    mag
2     iv
3    ina
4    ani
Name: Name, dtype: object

In [23]:
pup["Name"].to_frame().assign(First_char= pup["Name"].str.slice(0,2)).head()

   Name First_char
0  adar         ad
1  agam         ag
2   avi         av
3  dani         da
4  dina         di

In [24]:
pup

       Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0      adar    6      SP     113      30   70   16700      7       6     1   M
1      agam    6      GR     172      71   92    9200      5       4     2   F
2       avi    7     ISR     143      58   82   12000      3       7     1   M
3      dani    7      US     160      70   90   15000      4       4     2   M
4      dina    7     ISR     110      26   64   10000      6       8     1   F
5     efrat    7      EN     115      33   75    8000      5       5     3   F
6      ehud    8     ISR     155      66   85   18000      2       7     1   M
7       eli    8      GR     155      61   84    8900      7      10     2   M
8     ester    8     ISR     130      48   79   19600      2       4     1   F
9   evyatar    8     ISR     110      34   72    7600      3       4     1   M
10   itamar    8      EN     110      30   71   27000      2       5     2   M
11     liel    8     ISR     142      55   84   24000      2       7     1   M
12   lilach    9     ISR     192      88   94   23000      5       6     2   F
13      mia    9      GR     132      49   82   12800      4       5     3   F
14   michal    9      US     132      53   79   20400      5       7     3   F
15    moshe    9      GR     128      43   80   42000      6       5     3   M
16     noya    9      SP      90      27   68   18200      6       5     1   F
17     ofer   10      SP     110      34   71    9300      4       8     1   M
18     ohad   10     ISR     159      64   83   12700      4       8     1   M
19     omer   10      US     162      68   87   34500      6       8     2   F
20     orit   10      US     123      40   78   18900      3       7     3   F
21     orit   11     ISR     175      73   89   54100      4       3     2   F
22     rina   11      EN     100      31   73   30000      2       5     3   F
23    shely   11     ISR     148      60   86    8000      4       3     1   F
24    talya   12      FR     167      67   89   10900      6       6     2   F
25    tomer   12      FR     128      53   82   45000      5       4     3   M
26      udi   13      FR     147      55   85   35000      7       6     2   M
27    yafit   13      FR     180      90   93   12800      2       4     1   F
28     yoav   13      EN     120      36   74   17300      5       8     3   M
29     yosi   14      SP     110      32   74   22000      5       6     1   M

In [25]:
pup["Name"].head().to_frame().assign(First_char= pup["Name"].str.slice(0,2))

   Name First_char
0  adar         ad
1  agam         ag
2   avi         av
3  dani         da
4  dina         di

In [26]:
pup["Name"].assign(First_char= pup["Name"].str.slice(0,2)).head().to_frame()

AttributeError: 'Series' object has no attribute 'assign'

In [27]:
pup[["Name"]].assign(First_char= pup["Name"].str.slice(0,2)).head()

   Name First_char
0  adar         ad
1  agam         ag
2   avi         av
3  dani         da
4  dina         di

In [28]:
pup["Name"].str.len().head()

0    4
1    4
2    3
3    4
4    4
Name: Name, dtype: int64

In [29]:
pup["Name"].to_frame().assign(len=pup["Name"].str.len()).head()

   Name  len
0  adar    4
1  agam    4
2   avi    3
3  dani    4
4  dina    4

In [30]:
s =pd.Series(['1.  Hello    ','2.  World!\n ','3.  python.\t' ])

In [31]:
s.head()

0    1.  Hello
1    2.  World!\n
2    3.  python.\t
dtype: object

In [32]:
s.str.strip() # trim in sql

0      1.  Hello
1     2.  World!
2    3.  python.
dtype: object

In [33]:
s.str.lstrip('123. ')

0    Hello
1    World!\n
2    python.\t
dtype: object

In [34]:
s.str.rstrip('!.\n\t ')

0     1.  Hello
1     2.  World
2    3.  python
dtype: object

In [37]:
s.str.strip('123!.\n\t ')

0     Hello
1     World
2    python
dtype: object

In [39]:
"v1-"+s.str.strip(" !123.\n\t")+"-v2"

0     v1-Hello-v2
1     v1-World-v2
2    v1-python-v2
dtype: object

In [40]:
pup["Name"].head(20)

0        adar
1        agam
2         avi
3        dani
4        dina
5       efrat
6        ehud
7         eli
8       ester
9     evyatar
10     itamar
11       liel
12     lilach
13        mia
14     michal
15      moshe
16       noya
17       ofer
18       ohad
19       omer
Name: Name, dtype: object

In [41]:
pup["Name"].str.strip('ae').head(10)

0       dar
1       gam
2        vi
3      dani
4       din
5      frat
6       hud
7        li
8      ster
9    vyatar
Name: Name, dtype: object

In [ ]:
#replace

In [42]:
pup["Name"].str.replace('a','_').head()

0    _d_r
1    _g_m
2     _vi
3    d_ni
4    din_
Name: Name, dtype: object

In [ ]:
#upper() , lower() , title()

In [43]:
pup["Name"].str.upper().head()

0    ADAR
1    AGAM
2     AVI
3    DANI
4    DINA
Name: Name, dtype: object

In [44]:
pup["Name"].str.lower().head()

0    adar
1    agam
2     avi
3    dani
4    dina
Name: Name, dtype: object

In [45]:
pup["Name"].str.title().head()

0    Adar
1    Agam
2     Avi
3    Dani
4    Dina
Name: Name, dtype: object

In [46]:
pup["Name"].to_frame().assign(initcap=pup["Name"].str.title()).head()

   Name initcap
0  adar    Adar
1  agam    Agam
2   avi     Avi
3  dani    Dani
4  dina    Dina

In [47]:
pupc=pup["Name"].to_frame()#.assign(initcap=pup["Name"].str.title()).head()

In [48]:
pupc

       Name
0      adar
1      agam
2       avi
3      dani
4      dina
5     efrat
6      ehud
7       eli
8     ester
9   evyatar
10   itamar
11     liel
12   lilach
13      mia
14   michal
15    moshe
16     noya
17     ofer
18     ohad
19     omer
20     orit
21     orit
22     rina
23    shely
24    talya
25    tomer
26      udi
27    yafit
28     yoav
29     yosi

In [51]:
pupc["Name1"]=pupc["Name"].str.lower()

In [52]:
pupc

       Name    Name1
0      Adar     adar
1      Agam     agam
2       Avi      avi
3      Dani     dani
4      Dina     dina
5     Efrat    efrat
6      Ehud     ehud
7       Eli      eli
8     Ester    ester
9   Evyatar  evyatar
10   Itamar   itamar
11     Liel     liel
12   Lilach   lilach
13      Mia      mia
14   Michal   michal
15    Moshe    moshe
16     Noya     noya
17     Ofer     ofer
18     Ohad     ohad
19     Omer     omer
20     Orit     orit
21     Orit     orit
22     Rina     rina
23    Shely    shely
24    Talya    talya
25    Tomer    tomer
26      Udi      udi
27    Yafit    yafit
28     Yoav     yoav
29     Yosi     yosi

In [53]:
mask = pup["Name"].str.lower()=='agam'

In [54]:
pup[mask]

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
1  agam    6      GR     172      71   92    9200      5       4     2   F

In [55]:
s

0    1.  Hello
1    2.  World!\n
2    3.  python.\t
dtype: object

In [56]:
s =pd.Series(['Hello World', "Hi Python"])

In [57]:
s

0    Hello World
1      Hi Python
dtype: object

In [58]:
s.str.split(' ')

0    [Hello, World]
1      [Hi, Python]
dtype: object

In [60]:
s.to_frame().assign(a =s.str.split(' ').str[0],
                    b=s.str.split(' ').str[-1])

             0      a       b
0  Hello World  Hello   World
1    Hi Python     Hi  Python

In [61]:
pup.head()

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0  adar    6      SP     113      30   70   16700      7       6     1   M
1  agam    6      GR     172      71   92    9200      5       4     2   F
2   avi    7     ISR     143      58   82   12000      3       7     1   M
3  dani    7      US     160      70   90   15000      4       4     2   M
4  dina    7     ISR     110      26   64   10000      6       8     1   F

In [62]:
products.head()

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2
0,1,Chai,18.00,1,05/12/2022,15/12/2022
1,2,Chang,19.00,1,06/12/2022,16/12/2022
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022

In [63]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    77 non-null     int64
 1   ProductName  77 non-null     object
 2   UnitPrice    77 non-null     float64
 3   CategoryID   77 non-null     int64
 4   Date1        77 non-null     object
 5   Date2        77 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 3.7+ KB

In [71]:
products["ProductName"].str.split().head(10)

0                                   [Chai]
1                                  [Chang]
2                         [Aniseed, Syrup]
3        [Chef, Anton's, Cajun, Seasoning]
4              [Chef, Anton's, Gumbo, Mix]
5         [Grandma's, Boysenberry, Spread]
6    [Uncle, Bob's, Organic, Dried, Pears]
7           [Northwoods, Cranberry, Sauce]
8                      [Mishi, Kobe, Niku]
9                                  [Ikura]
Name: ProductName, dtype: object

In [66]:
products["ProductName"].str.split(expand=True)

               0            1      2          3     4
0           Chai         None   None       None  None
1          Chang         None   None       None  None
2        Aniseed        Syrup   None       None  None
3           Chef      Anton's  Cajun  Seasoning  None
4           Chef      Anton's  Gumbo        Mix  None
..           ...          ...    ...        ...   ...
72           Rad       Kaviar   None       None  None
73      Longlife         Tofu   None       None  None
74      Rhanbrau  Klosterbier   None       None  None
75  Lakkalikaari         None   None       None  None
76      Original  Frankfurter  grane       Soae  None

[77 rows x 5 columns]

In [67]:
products["ProductName"].str.split(expand=True)[0]

0             Chai
1            Chang
2          Aniseed
3             Chef
4             Chef
          ...
72             Rad
73        Longlife
74        Rhanbrau
75    Lakkalikaari
76        Original
Name: 0, Length: 77, dtype: object

In [69]:
products["ProductName"].str.split(expand=True)[4].head(50)

0        None
1        None
2        None
3        None
4        None
5        None
6       Pears
7        None
8        None
9        None
10       None
11       None
12       None
13       None
14       None
15       None
16       None
17       None
18       None
19       None
20       None
21       None
22       None
23       None
24       None
25       None
26       None
27       None
28       None
29       None
30       None
31       None
32       None
33       None
34       None
35       None
36       None
37       None
38       None
39       None
40    Chowder
41       None
42       None
43       None
44       None
45       None
46       None
47       None
48       None
49       None
Name: 4, dtype: object

In [72]:
products["start name"]=products["ProductName"].str.split(expand=True)[0]

In [73]:
products.head()

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,start name
0,1,Chai,18.00,1,05/12/2022,15/12/2022,Chai
1,2,Chang,19.00,1,06/12/2022,16/12/2022,Chang
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,Aniseed
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,Chef
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,Chef

# Numeric Functions

In [ ]:
#round()

In [74]:
pup.head()

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0  adar    6      SP     113      30   70   16700      7       6     1   M
1  agam    6      GR     172      71   92    9200      5       4     2   F
2   avi    7     ISR     143      58   82   12000      3       7     1   M
3  dani    7      US     160      70   90   15000      4       4     2   M
4  dina    7     ISR     110      26   64   10000      6       8     1   F

In [75]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [76]:
import numpy as np
np.round(df["total_bill"],0)

0      17.0
1      10.0
2      21.0
3      24.0
4      25.0
       ...
239    29.0
240    27.0
241    23.0
242    18.0
243    19.0
Name: total_bill, Length: 244, dtype: float64

In [77]:
df["total_bill"].round(1).head()

0    17.0
1    10.3
2    21.0
3    23.7
4    24.6
Name: total_bill, dtype: float64

In [78]:
np.floor(df["total_bill"]).head()

0    16.0
1    10.0
2    21.0
3    23.0
4    24.0
Name: total_bill, dtype: float64

In [79]:
np.ceil(df["total_bill"]).head()

0    17.0
1    11.0
2    22.0
3    24.0
4    25.0
Name: total_bill, dtype: float64

In [ ]:
#mul = Multiply DataFrames., div = Divide DataFrames

In [80]:
df["total_bill"].mul(100)

0      1699.0
1      1034.0
2      2101.0
3      2368.0
4      2459.0
        ...
239    2903.0
240    2718.0
241    2267.0
242    1782.0
243    1878.0
Name: total_bill, Length: 244, dtype: float64

In [81]:
df["total_bill"].div(10)

0      1.699
1      1.034
2      2.101
3      2.368
4      2.459
       ...
239    2.903
240    2.718
241    2.267
242    1.782
243    1.878
Name: total_bill, Length: 244, dtype: float64

In [82]:
np.ceil(df["total_bill"].mul(100)).div(100).head()

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

# Date Functions

In [84]:
import pandas as pd
products = pd.read_csv("data/Products.csv")

In [85]:
products.head(20)

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2
0,1,Chai,18.00,1,05/12/2022,15/12/2022
1,2,Chang,19.00,1,06/12/2022,16/12/2022
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022
5,6,Grandma's Boysenberry Spread,25.00,2,11/12/2022,20/12/2022
6,7,Uncle Bob's Organic Dried Pears,30.00,7,12/12/2022,21/12/2022
7,8,Northwoods Cranberry Sauce,40.00,2,13/12/2022,22/12/2022
8,9,Mishi Kobe Niku,97.00,6,14/12/2022,23/12/2022
9,10,Ikura,31.00,8,15/12/2022,24/12/2022
10,11,Queso Cabrales,21.00,4,16/12/2022,25/12/2022
11,12,Queso Manchego La Pastora,38.00,4,18/12/2022,26/12/2022
12,13,Konbu,6.00,8,19/12/2022,27/12/2022
13,14,Tofu,23.25,7,20/12/2022,28/12/2022
14,15,Genen Shouyu,15.50,2,21/12/2022,29/12/2022
15,16,Pavlova,17.45,3,22/12/2022,30/12/2022
16,17,Alice Mutton,39.00,6,23/12/2022,31/12/2022
17,18,Carnarvon Tigers,62.50,8,25/12/2022,01/01/2023
18,19,Teatime Chocolate Biscuits,9.20,3,26/12/2022,02/01/2023
19,20,Sir Rodney's Marmalade,81.00,3,27/12/2022,03/01/2023

In [86]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    77 non-null     int64
 1   ProductName  77 non-null     object
 2   UnitPrice    77 non-null     float64
 3   CategoryID   77 non-null     int64
 4   Date1        77 non-null     object
 5   Date2        77 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 3.7+ KB

In [ ]:
products["Date"]=pd.to_datetime(products["Date1"],format="%d/%m/%Y")

In [88]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    77 non-null     int64
 1   ProductName  77 non-null     object
 2   UnitPrice    77 non-null     float64
 3   CategoryID   77 non-null     int64
 4   Date1        77 non-null     object
 5   Date2        77 non-null     object
 6   Date         77 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 4.3+ KB

In [89]:
products.head(30).sort_values("Date")

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,Date
0,1,Chai,18.00,1,05/12/2022,15/12/2022,2022-12-05
1,2,Chang,19.00,1,06/12/2022,16/12/2022,2022-12-06
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,2022-12-07
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,2022-12-08
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,2022-12-09
5,6,Grandma's Boysenberry Spread,25.00,2,11/12/2022,20/12/2022,2022-12-11
6,7,Uncle Bob's Organic Dried Pears,30.00,7,12/12/2022,21/12/2022,2022-12-12
7,8,Northwoods Cranberry Sauce,40.00,2,13/12/2022,22/12/2022,2022-12-13
8,9,Mishi Kobe Niku,97.00,6,14/12/2022,23/12/2022,2022-12-14
9,10,Ikura,31.00,8,15/12/2022,24/12/2022,2022-12-15
10,11,Queso Cabrales,21.00,4,16/12/2022,25/12/2022,2022-12-16
11,12,Queso Manchego La Pastora,38.00,4,18/12/2022,26/12/2022,2022-12-18
12,13,Konbu,6.00,8,19/12/2022,27/12/2022,2022-12-19
13,14,Tofu,23.25,7,20/12/2022,28/12/2022,2022-12-20
14,15,Genen Shouyu,15.50,2,21/12/2022,29/12/2022,2022-12-21
15,16,Pavlova,17.45,3,22/12/2022,30/12/2022,2022-12-22
16,17,Alice Mutton,39.00,6,23/12/2022,31/12/2022,2022-12-23
17,18,Carnarvon Tigers,62.50,8,25/12/2022,01/01/2023,2022-12-25
18,19,Teatime Chocolate Biscuits,9.20,3,26/12/2022,02/01/2023,2022-12-26
19,20,Sir Rodney's Marmalade,81.00,3,27/12/2022,03/01/2023,2022-12-27
20,21,Sir Rodney's Scones,10.00,3,28/12/2022,04/01/2023,2022-12-28
21,22,Gustaf's Knackebrad,21.00,5,29/12/2022,05/01/2023,2022-12-29
22,23,Tunnbrad,9.00,5,30/12/2022,06/01/2023,2022-12-30
23,24,Guarana Fantastica,4.50,1,01/01/2023,07/01/2023,2023-01-01
24,25,NuNuCa Nua-Nougat-Creme,14.00,3,02/01/2023,08/01/2023,2023-01-02
25,26,Gumbar Gummibarchen,31.23,3,03/01/2023,09/01/2023,2023-01-03
26,27,Schoggi Schokolade,43.90,3,04/01/2023,10/01/2023,2023-01-04
27,28,Rassle Sauerkraut,45.60,7,05/01/2023,11/01/2023,2023-01-05
28,29,Tharinger Rostbratwurst,123.79,6,06/01/2023,12/01/2023,2023-01-06
29,30,Nord-Ost Matjeshering,25.89,8,08/01/2023,13/01/2023,2023-01-08

In [90]:
import datetime as dt

In [91]:
pd.Timestamp.today()

Timestamp('2025-01-20 10:12:09.328661')

In [92]:
products["Date"].dt.year.head()

0    2022
1    2022
2    2022
3    2022
4    2022
Name: Date, dtype: int32

In [96]:
products["Date"].dt.month_name()

0     December
1     December
2     December
3     December
4     December
        ...
72    February
73    February
74       March
75       March
76       March
Name: Date, Length: 77, dtype: object

In [97]:
products.assign(year1 =products["Date"].dt.year).head()

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,Date,year1
0,1,Chai,18.00,1,05/12/2022,15/12/2022,2022-12-05,2022
1,2,Chang,19.00,1,06/12/2022,16/12/2022,2022-12-06,2022
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,2022-12-07,2022
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,2022-12-08,2022
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,2022-12-09,2022

In [98]:
products

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,Date
0,1,Chai,18.00,1,05/12/2022,15/12/2022,2022-12-05
1,2,Chang,19.00,1,06/12/2022,16/12/2022,2022-12-06
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,2022-12-07
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,2022-12-08
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,2022-12-09
...,...,...,...,...,...,...,...
72,73,Rad Kaviar,15.00,8,27/02/2023,25/02/2023,2023-02-27
73,74,Longlife Tofu,10.00,7,28/02/2023,26/02/2023,2023-02-28
74,75,Rhanbrau Klosterbier,7.75,1,01/03/2023,27/02/2023,2023-03-01
75,76,Lakkalikaari,18.00,1,02/03/2023,28/02/2023,2023-03-02
76,77,Original Frankfurter grane Soae,13.00,2,03/03/2023,01/03/2023,2023-03-03

In [99]:
products["MM"]=products["Date"].dt.month

In [100]:
products.head()

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,Date,MM
0,1,Chai,18.00,1,05/12/2022,15/12/2022,2022-12-05,12
1,2,Chang,19.00,1,06/12/2022,16/12/2022,2022-12-06,12
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,2022-12-07,12
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,2022-12-08,12
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,2022-12-09,12

In [101]:
products["Date"].dt.day.head()

0    5
1    6
2    7
3    8
4    9
Name: Date, dtype: int32

In [106]:
products["Date"].dt.day_name()

0        Monday
1       Tuesday
2     Wednesday
3      Thursday
4        Friday
        ...
72       Monday
73      Tuesday
74    Wednesday
75     Thursday
76       Friday
Name: Date, Length: 77, dtype: object

In [107]:
pd.Timestamp.today() -products["Date"]  #.head()

0    777 days 10:19:25.537797
1    776 days 10:19:25.537797
2    775 days 10:19:25.537797
3    774 days 10:19:25.537797
4    773 days 10:19:25.537797
               ...
72   693 days 10:19:25.537797
73   692 days 10:19:25.537797
74   691 days 10:19:25.537797
75   690 days 10:19:25.537797
76   689 days 10:19:25.537797
Name: Date, Length: 77, dtype: timedelta64[ns]

In [112]:
(pd.Timestamp.today() -products["Date"] )/12

0    64 days 18:51:51.705529833
1    64 days 16:51:51.705529833
2    64 days 14:51:51.705529833
3    64 days 12:51:51.705529833
4    64 days 10:51:51.705529833
                ...
72   57 days 18:51:51.705529833
73   57 days 16:51:51.705529833
74   57 days 14:51:51.705529833
75   57 days 12:51:51.705529833
76   57 days 10:51:51.705529833
Name: Date, Length: 77, dtype: timedelta64[ns]

In [124]:
((pd.Timestamp.today() -products["Date"] ).dt.days/12).round(1)

0     64.8
1     64.7
2     64.6
3     64.5
4     64.4
      ...
72    57.8
73    57.7
74    57.6
75    57.5
76    57.4
Name: Date, Length: 77, dtype: float64

In [113]:
orders = pd.read_excel("data/orders.xlsx")

In [114]:
orders.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,NaN,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,NaN,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,NaN,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,NaN,B-6000,Belgium

In [115]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   OrderID         830 non-null    int64
 1   CustomerID      830 non-null    object
 2   EmployeeID      830 non-null    int64
 3   OrderDate       830 non-null    datetime64[ns]
 4   RequiredDate    830 non-null    datetime64[ns]
 5   ShippedDate     809 non-null    datetime64[ns]
 6   ShipVia         830 non-null    int64
 7   Freight         830 non-null    float64
 8   ShipName        830 non-null    object
 9   ShipAddress     830 non-null    object
 10  ShipCity        830 non-null    object
 11  ShipRegion      323 non-null    object
 12  ShipPostalCode  811 non-null    object
 13  ShipCountry     830 non-null    object
dtypes: datetime64[ns](3), float64(1), int64(3), object(7)
memory usage: 90.9+ KB

In [116]:
timedelta_day=pd.Timestamp.today() -orders["OrderDate"]

In [ ]:
timedelta_day

In [119]:
timedelta_day.dt.days/365

0      28.567123
1      28.564384
2      28.556164
3      28.556164
4      28.553425
         ...
825    26.731507
826    26.728767
827    26.728767
828    26.728767
829    26.728767
Name: OrderDate, Length: 830, dtype: float64

In [126]:
emp=pd.read_table('data/employee.txt')

In [127]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290 entries, 0 to 289
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   BusinessEntityID  290 non-null    int64
 1   FirstName         290 non-null    object
 2   LastName          290 non-null    object
 3   HireDate          290 non-null    object
dtypes: int64(1), object(3)
memory usage: 9.2+ KB

# Convert Functions

In [153]:
#conver str to number

In [128]:
num_s = '$1345.9'
type(num_s)

str

In [131]:
pd.to_numeric('54554.32')

np.float64(54554.32)

In [129]:
pd.to_numeric(num_s)

ValueError: Unable to parse string "$1345.9" at position 0

In [132]:
num = num_s.replace('$','')
print(num)
type(num)

1345.9

str

In [133]:
num1 =pd.to_numeric(num)

In [134]:
type(num1)

numpy.float64

In [135]:
type(num)

str

In [136]:
num2=pd.to_numeric(num1)

In [137]:
print(num2)

1345.9

In [138]:
type(num2)

numpy.float64

In [139]:
n1='1,450'

In [140]:
type(n1)

str

In [141]:
n1=pd.to_numeric(n1)

ValueError: Unable to parse string "1,450" at position 0

In [142]:
type(n1)

str

In [146]:
n1=pd.to_numeric(n1)

ValueError: Unable to parse string "1,450" at position 0

In [147]:
n1=pd.to_numeric(n1,errors='ignore')

C:\Users\jbt\AppData\Local\Temp\ipykernel_13660\1727090320.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_numeric without passing `errors` and catch exceptions explicitly instead
  n1=pd.to_numeric(n1,errors='ignore')

In [144]:
type(n1)

str

In [145]:
n1

'1,450'

In [148]:
n2 =n1.replace(',','')

In [149]:
n2

'1450'

In [ ]:
type(n2)

In [150]:
n2=pd.to_numeric(n2)

In [151]:
n2

np.int64(1450)

In [152]:
type(n2)

numpy.int64

#Convert String to_datetime

In [154]:
dt1 = '31-12-2018'

In [155]:
type(dt1)

str

In [156]:
dt2 =pd.to_datetime(dt1)

C:\Users\jbt\AppData\Local\Temp\ipykernel_13660\4037734424.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  dt2 =pd.to_datetime(dt1)

In [157]:
type(dt2)

pandas._libs.tslibs.timestamps.Timestamp

In [158]:
dt2

Timestamp('2018-12-31 00:00:00')

In [159]:
dtn = '01-12-2018'

In [160]:
dtn

'01-12-2018'

In [166]:
type(dtn)

str

In [162]:
pd.to_datetime(dtn)

Timestamp('2018-01-12 00:00:00')

In [167]:
pd.to_datetime(dtn,dayfirst=True)

Timestamp('2018-12-01 00:00:00')

In [163]:
dt2.year

2018

In [164]:
dt2.month

12

In [165]:
dt2.day

31

In [ ]:
#Convert to string

In [ ]:
#astype(str)

In [168]:
products

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,Date,MM
0,1,Chai,18.00,1,05/12/2022,15/12/2022,2022-12-05,12
1,2,Chang,19.00,1,06/12/2022,16/12/2022,2022-12-06,12
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,2022-12-07,12
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,2022-12-08,12
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,2022-12-09,12
...,...,...,...,...,...,...,...,...
72,73,Rad Kaviar,15.00,8,27/02/2023,25/02/2023,2023-02-27,2
73,74,Longlife Tofu,10.00,7,28/02/2023,26/02/2023,2023-02-28,2
74,75,Rhanbrau Klosterbier,7.75,1,01/03/2023,27/02/2023,2023-03-01,3
75,76,Lakkalikaari,18.00,1,02/03/2023,28/02/2023,2023-03-02,3
76,77,Original Frankfurter grane Soae,13.00,2,03/03/2023,01/03/2023,2023-03-03,3

In [169]:
products["Date"].astype('str')

0     2022-12-05
1     2022-12-06
2     2022-12-07
3     2022-12-08
4     2022-12-09
         ...
72    2023-02-27
73    2023-02-28
74    2023-03-01
75    2023-03-02
76    2023-03-03
Name: Date, Length: 77, dtype: object

In [170]:
products["Date"] = products["Date"].astype('str')

In [171]:
products["Date"]

0     2022-12-05
1     2022-12-06
2     2022-12-07
3     2022-12-08
4     2022-12-09
         ...
72    2023-02-27
73    2023-02-28
74    2023-03-01
75    2023-03-02
76    2023-03-03
Name: Date, Length: 77, dtype: object

In [172]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    77 non-null     int64
 1   ProductName  77 non-null     object
 2   UnitPrice    77 non-null     float64
 3   CategoryID   77 non-null     int64
 4   Date1        77 non-null     object
 5   Date2        77 non-null     object
 6   Date         77 non-null     object
 7   MM           77 non-null     int32
dtypes: float64(1), int32(1), int64(2), object(4)
memory usage: 4.6+ KB

In [173]:
products

,ProductID,ProductName,UnitPrice,CategoryID,Date1,Date2,Date,MM
0,1,Chai,18.00,1,05/12/2022,15/12/2022,2022-12-05,12
1,2,Chang,19.00,1,06/12/2022,16/12/2022,2022-12-06,12
2,3,Aniseed Syrup,10.00,2,07/12/2022,17/12/2022,2022-12-07,12
3,4,Chef Anton's Cajun Seasoning,22.00,2,08/12/2022,18/12/2022,2022-12-08,12
4,5,Chef Anton's Gumbo Mix,21.35,2,09/12/2022,19/12/2022,2022-12-09,12
...,...,...,...,...,...,...,...,...
72,73,Rad Kaviar,15.00,8,27/02/2023,25/02/2023,2023-02-27,2
73,74,Longlife Tofu,10.00,7,28/02/2023,26/02/2023,2023-02-28,2
74,75,Rhanbrau Klosterbier,7.75,1,01/03/2023,27/02/2023,2023-03-01,3
75,76,Lakkalikaari,18.00,1,02/03/2023,28/02/2023,2023-03-02,3
76,77,Original Frankfurter grane Soae,13.00,2,03/03/2023,01/03/2023,2023-03-03,3

In [ ]:
#Nulls

In [174]:
cust = pd.read_csv("data/Customers.csv")

In [175]:
cust.head(5)

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,NaN,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,NaN,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NaN,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,NaN,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [176]:
cust[["CustomerID","CompanyName","Region"]].head()

   CustomerID                         CompanyName Region
0           1                 Alfreds Futterkiste    NaN
1           2  Ana Trujillo Emparedados y helados    NaN
2           3             Antonio Moreno Taquería    NaN
3           4                     Around the Horn    NaN
4           5                  Berglunds snabbköp    NaN

In [177]:
ifnull =cust["Region"].isnull()

In [178]:
cust[ifnull].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,NaN,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,NaN,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NaN,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,NaN,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [179]:
ifnotnull =cust["Region"].notnull()

In [180]:
cust[ifnotnull].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
9,10,Bottom-Dollar Markets,Elizabeth Lincoln,Accounting Manager,23 Tsawassen Blvd.,Tsawassen,BC,T2F 8M4,Canada,(604) 555-4729,(604) 555-3745
14,15,Comércio Mineiro,Pedro Afonso,Sales Associate,"Av. dos Lusíadas, 23",Sao Paulo,SP,05432-043,Brazil,(11) 555-7647,NaN
20,21,Familia Arquibaldo,Aria Cruz,Marketing Assistant,"Rua Orós, 92",Sao Paulo,SP,05442-030,Brazil,(11) 555-9857,NaN
30,31,Gourmet Lanchonetes,André Fonseca,Sales Associate,"Av. Brasil, 442",Campinas,SP,04876-786,Brazil,(11) 555-9482,NaN
31,32,Great Lakes Food Market,Howard Snyder,Marketing Manager,2732 Baker Blvd.,Eugene,OR,97403,USA,(503) 555-7555,NaN

In [ ]:
#Filling null values with the previous ones -- fillna()

In [181]:
cust["Region"] = cust["Region"].fillna("No Region")

In [182]:
cust.head(5)

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,No Region,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,No Region,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,No Region,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,No Region,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,No Region,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [ ]:
#Dropping missing values using dropna()

In [183]:
cust.count()

CustomerID      91
CompanyName     91
ContactName     91
ContactTitle    91
Address         91
City            91
Region          91
PostalCode      90
Country         91
Phone           91
Fax             69
dtype: int64

In [184]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    91 non-null     int64
 1   CompanyName   91 non-null     object
 2   ContactName   91 non-null     object
 3   ContactTitle  91 non-null     object
 4   Address       91 non-null     object
 5   City          91 non-null     object
 6   Region        91 non-null     object
 7   PostalCode    90 non-null     object
 8   Country       91 non-null     object
 9   Phone         91 non-null     object
 10  Fax           69 non-null     object
dtypes: int64(1), object(10)
memory usage: 7.9+ KB

In [185]:
a= cust["PostalCode"].isnull()

In [186]:
cust[a].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
36,37,Hungry Owl All-Night Grocers,Patricia McKenna,Sales Associate,8 Johnstown Road,Cork,Co. Cork,NaN,Ireland,2967 542,2967 3333

In [187]:
#drop all rows that have any NaN values
dn=cust.dropna()

In [188]:
dn.head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,No Region,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,No Region,5021,Mexico,(5) 555-4729,(5) 555-3745
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,No Region,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,No Region,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
5,6,Blauer See Delikatessen,Hanna Moos,Sales Representative,Forsterstr. 57,Mannheim,No Region,68306,Germany,0621-08460,0621-08924

In [189]:
dn.count()

CustomerID      68
CompanyName     68
ContactName     68
ContactTitle    68
Address         68
City            68
Region          68
PostalCode      68
Country         68
Phone           68
Fax             68
dtype: int64

In [190]:
 #drop only if ALL columns are NaN
dn1=cust.dropna(how='all')

In [191]:
dn1.count()

CustomerID      91
CompanyName     91
ContactName     91
ContactTitle    91
Address         91
City            91
Region          91
PostalCode      90
Country         91
Phone           91
Fax             69
dtype: int64

In [192]:
#Drop only if NaN in specific column (as asked in the question)
dn2=cust.dropna(subset=["PostalCode"])

In [193]:
dn2.count()

CustomerID      90
CompanyName     90
ContactName     90
ContactTitle    90
Address         90
City            90
Region          90
PostalCode      90
Country         90
Phone           90
Fax             68
dtype: int64

In [194]:
cust.count()

CustomerID      91
CompanyName     91
ContactName     91
ContactTitle    91
Address         91
City            91
Region          91
PostalCode      90
Country         91
Phone           91
Fax             69
dtype: int64

In [195]:
cust.dropna(subset=['PostalCode'])

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,No Region,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,No Region,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,No Region,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,No Region,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,No Region,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,No Region,90110,Finland,981-443655,981-443655
87,88,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,SP,08737-363,Brazil,(14) 555-8122,NaN
88,89,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,WA,98128,USA,(206) 555-4112,(206) 555-4115
89,90,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,No Region,21240,Finland,90-224 8858,90-224 8858
90,91,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,No Region,01-012,Poland,(26) 642-7012,(26) 642-7012

In [196]:
cust

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,No Region,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,No Region,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,No Region,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,No Region,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,No Region,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,No Region,90110,Finland,981-443655,981-443655
87,88,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,SP,08737-363,Brazil,(14) 555-8122,NaN
88,89,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,WA,98128,USA,(206) 555-4112,(206) 555-4115
89,90,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,No Region,21240,Finland,90-224 8858,90-224 8858
90,91,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,No Region,01-012,Poland,(26) 642-7012,(26) 642-7012

In [197]:
cust.dropna(subset=['PostalCode'],inplace=True)

In [198]:
cust.count()

CustomerID      90
CompanyName     90
ContactName     90
ContactTitle    90
Address         90
City            90
Region          90
PostalCode      90
Country         90
Phone           90
Fax             68
dtype: int64